In [2]:
import pandas as pd

In [3]:
pip install xmltodict

Requirement already satisfied: xmltodict in c:\users\user\anaconda3\lib\site-packages (0.13.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import xmltodict
with open('regions.xml') as xml_file:
    df=xmltodict.parse(xml_file.read())

df

{'data': {'region': [{'id': '1', 'name': 'North', 'manager': 'Mary Johnson'},
   {'id': '2', 'name': 'South', 'manager': 'Robert Lee'},
   {'id': '3', 'name': 'East', 'manager': 'Patricia Williams'},
   {'id': '4', 'name': 'West', 'manager': 'James Brown'}]}}

In [5]:
region=df['data']['region']
region

[{'id': '1', 'name': 'North', 'manager': 'Mary Johnson'},
 {'id': '2', 'name': 'South', 'manager': 'Robert Lee'},
 {'id': '3', 'name': 'East', 'manager': 'Patricia Williams'},
 {'id': '4', 'name': 'West', 'manager': 'James Brown'}]

In [58]:
for employee in region:
    print(f"id:{employee['id']},name:{employee['name']},manager:{employee['manager']}")

id:1,name:North,manager:Mary Johnson
id:2,name:South,manager:Robert Lee
id:3,name:East,manager:Patricia Williams
id:4,name:West,manager:James Brown

READING TEXT FILE

In [8]:
df1 = pd.read_csv("customers.csv")
print(df1)

   customer_id           name  age          city
0            1       John Doe   28      New York
1            2     Jane Smith   34   Los Angeles
2            3    Emily Davis   22       Chicago
3            4  Michael Brown   45       Houston
4            5  Linda Johnson   31  Philadelphia

In [9]:
df1.describe()

       customer_id        age
count     5.000000   5.000000
mean      3.000000  32.000000
std       1.581139   8.514693
min       1.000000  22.000000
25%       2.000000  28.000000
50%       3.000000  31.000000
75%       4.000000  34.000000
max       5.000000  45.000000

In [10]:
df1.nunique()

customer_id    5
name           5
age            5
city           5
dtype: int64

In [11]:
df1['city']

0        New York
1     Los Angeles
2         Chicago
3         Houston
4    Philadelphia
Name: city, dtype: object

In [12]:
df1.columns

Index(['customer_id', 'name', 'age', 'city'], dtype='object')

In [13]:
df1.head()

   customer_id           name  age          city
0            1       John Doe   28      New York
1            2     Jane Smith   34   Los Angeles
2            3    Emily Davis   22       Chicago
3            4  Michael Brown   45       Houston
4            5  Linda Johnson   31  Philadelphia

In [14]:
df1.tail()

   customer_id           name  age          city
0            1       John Doe   28      New York
1            2     Jane Smith   34   Los Angeles
2            3    Emily Davis   22       Chicago
3            4  Michael Brown   45       Houston
4            5  Linda Johnson   31  Philadelphia

In [15]:
df1.sort_values(by ="age")

   customer_id           name  age          city
2            3    Emily Davis   22       Chicago
0            1       John Doe   28      New York
4            5  Linda Johnson   31  Philadelphia
1            2     Jane Smith   34   Los Angeles
3            4  Michael Brown   45       Houston

In [16]:
df1.sort_values(by ="age" ,ascending=False)

   customer_id           name  age          city
3            4  Michael Brown   45       Houston
1            2     Jane Smith   34   Los Angeles
4            5  Linda Johnson   31  Philadelphia
0            1       John Doe   28      New York
2            3    Emily Davis   22       Chicago

READING JSON FILE

In [6]:
df2 = pd.read_json("products.json")
print(df2)

   product_id        name     category  price
0           1      Laptop  Electronics   1000
1           2  Smartphone  Electronics    800
2           3        Desk    Furniture    150
3           4       Chair    Furniture    100

In [47]:
df2.describe()

       product_id        price
count    4.000000     4.000000
mean     2.500000   512.500000
std      1.290994   455.292946
min      1.000000   100.000000
25%      1.750000   137.500000
50%      2.500000   475.000000
75%      3.250000   850.000000
max      4.000000  1000.000000

In [48]:
df2.columns

Index(['product_id', 'name', 'category', 'price'], dtype='object')

In [49]:
df2.size

16

In [50]:
df2.head()

   product_id        name     category  price
0           1      Laptop  Electronics   1000
1           2  Smartphone  Electronics    800
2           3        Desk    Furniture    150
3           4       Chair    Furniture    100

In [51]:
df2.tail()

   product_id        name     category  price
0           1      Laptop  Electronics   1000
1           2  Smartphone  Electronics    800
2           3        Desk    Furniture    150
3           4       Chair    Furniture    100

In [52]:
df2.sort_values(by ="price")

   product_id        name     category  price
3           4       Chair    Furniture    100
2           3        Desk    Furniture    150
1           2  Smartphone  Electronics    800
0           1      Laptop  Electronics   1000

In [7]:
df3 = pd.read_csv("sales.txt")
print(df3)

  sale_id\tproduct_id\tcustomer_id\tamount\tdate
0                  101\t1\t1\t150.00\t2023-01-15
1                  102\t2\t2\t200.00\t2023-01-16
2                  103\t1\t3\t120.00\t2023-01-17
3                  104\t3\t4\t300.00\t2023-01-18
4                  105\t2\t5\t250.00\t2023-01-19

In [54]:
df3 = pd.read_csv("sales.txt",delimiter='\t')
print(df3)

   sale_id  product_id  customer_id  amount        date
0      101           1            1   150.0  2023-01-15
1      102           2            2   200.0  2023-01-16
2      103           1            3   120.0  2023-01-17
3      104           3            4   300.0  2023-01-18
4      105           2            5   250.0  2023-01-19

In [55]:
df4 = pd.read_csv("task.txt")
print(df4)

  Combine all the acquired data into a single DataFrame for analysis.
0  https://raw.githubusercontent.com/datascienced...

In [4]:
url="https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"
df4 = pd.read_csv(url)
df4.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

COMBINE DATAFRAMES

In [17]:
import pandas as pd

# Reading the data
df1 = pd.read_csv('customers.csv')
df2 = pd.read_json('products.json')
df3 = pd.read_csv('sales.txt', sep='\t')

# Combining the DataFrames
final_df = df3.merge(df2, on='product_id').merge(df1, on='customer_id')

# Display the final DataFrame
print(final_df)

   sale_id  product_id  customer_id  amount        date      name_x  \
0      101           1            1   150.0  2023-01-15      Laptop
1      103           1            3   120.0  2023-01-17      Laptop
2      102           2            2   200.0  2023-01-16  Smartphone
3      105           2            5   250.0  2023-01-19  Smartphone
4      104           3            4   300.0  2023-01-18        Desk

      category  price         name_y  age          city
0  Electronics   1000       John Doe   28      New York
1  Electronics   1000    Emily Davis   22       Chicago
2  Electronics    800     Jane Smith   34   Los Angeles
3  Electronics    800  Linda Johnson   31  Philadelphia
4    Furniture    150  Michael Brown   45       Houston